Tekla Open API Reference for Tekla Structures 2025
PlacingAttributes Constructor (Boolean, PlacingDistanceAttributes, PlacingQuarterAttributes)
 Creates a new placing quarter attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingAttributes(
	bool IsFixed,
	PlacingDistanceAttributes PlacingDistance,
	PlacingQuarterAttributes PlacingQuarter
)
Public Sub New (
	IsFixed As Boolean,
	PlacingDistance As PlacingDistanceAttributes,
	PlacingQuarter As PlacingQuarterAttributes
)
Parameters
IsFixed
Type: System.Boolean
Defines whether the object is using fixed or free placing.
PlacingDistance
Type: Tekla.Structures.Drawing.PlacingDistanceAttributes
The distances to be used for the placing.
PlacingQuarter
Type: Tekla.Structures.Drawing.PlacingQuarterAttributes
The directions in which the placing can find suitable locations.
See Also
Reference
PlacingAttributes Class
PlacingAttributes Overload
Tekla.Structures.Drawing Namespace